# Pandas Eleman İşlemleri

In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [4]:
sozluk = {"var1": s1, "var2": s2, "var3": s3}
sozluk

{'var1': array([3, 4, 0, 9, 8]),
 'var2': array([1, 7, 2, 4, 8]),
 'var3': array([2, 2, 2, 7, 4])}

In [5]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     3     1     2
1     4     7     2
2     0     2     2
3     9     4     7
4     8     8     4

In [6]:
df[0:1]

   var1  var2  var3
0     3     1     2

In [7]:
df.index = ["a", "b", "c", "d", "e"]
df

   var1  var2  var3
a     3     1     2
b     4     7     2
c     0     2     2
d     9     4     7
e     8     8     4

In [8]:
df["c":"e"]

   var1  var2  var3
c     0     2     2
d     9     4     7
e     8     8     4

In [9]:
#silme

In [10]:
df.drop("a", axis=0)

   var1  var2  var3
b     4     7     2
c     0     2     2
d     9     4     7
e     8     8     4

In [11]:
df

   var1  var2  var3
a     3     1     2
b     4     7     2
c     0     2     2
d     9     4     7
e     8     8     4

In [12]:
# kalıcı bir silme yapmak için atama yapılmalı yada 
df.drop("a", axis=0, inplace=True)

In [13]:
df

   var1  var2  var3
b     4     7     2
c     0     2     2
d     9     4     7
e     8     8     4

In [14]:
#fancy

In [15]:
l = ["c", "d"]

In [16]:
df.drop(l, axis=0, inplace=True)
df

   var1  var2  var3
b     4     7     2
e     8     8     4

In [17]:
#değişkenler için

In [18]:
df

   var1  var2  var3
b     4     7     2
e     8     8     4

In [19]:
"var1" in df

True

In [20]:
l = ["var1", "var4", "var2"]

In [21]:
for i in l:
    print(i in df)

True
False
True

In [22]:
df["var1"]

b    4
e    8
Name: var1, dtype: int32

In [23]:
df

   var1  var2  var3
b     4     7     2
e     8     8     4

In [24]:
df["var4"] = df["var1"] / df["var3"]
df

   var1  var2  var3  var4
b     4     7     2   2.0
e     8     8     4   2.0

In [25]:
# Değişken silme

In [26]:
df.drop("var4", axis=1)

   var1  var2  var3
b     4     7     2
e     8     8     4

In [27]:
df

   var1  var2  var3  var4
b     4     7     2   2.0
e     8     8     4   2.0

In [28]:
# inplace ile kullanım
df.drop("var4", axis=1, inplace=True)

In [29]:
df

   var1  var2  var3
b     4     7     2
e     8     8     4

In [30]:
# fancy
l = ["var1", "var2"]

In [31]:
df.drop(l, axis=1)

   var3
b     2
e     4